# Mac App Store packages
mas 'Xcode', id: 497799835
mas 'The Unarchiver', id: 425424353

# 3rd party Taps
tap "caskformula/caskformula"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/emacs"
tap "homebrew/fuse"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/versions"
tap "pothosware/pothos"

# Homebrew packages: GNU tools for macOS
brew "coreutils"
brew "binutils", link: true
brew "diffutils"
brew "lzip"
brew "ed", args: ["with-default-names"]
brew "findutils", args: ["with-default-names"]
brew "gettext"
brew "gnu-getopt"
brew "gnu-indent", args: ["with-default-names"]
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "gnu-which", args: ["with-default-names"]
brew "pcre"
brew "pkg-config"
brew "grep", args: ["with-default-names"]
brew "less"

# GNU TLS
brew "gmp"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "libunistring"
brew "gnutls"

# Dependencies and useful tools
brew "mpfr"
brew "readline"
brew "gawk"
brew "gzip"
brew "xz"
brew "unzip"
brew "zopfli"
brew "szip"
brew "libzip"
brew "p7zip"
brew "pigz"
brew "lzlib"
brew "zlib"

# GNU Parallel
brew "docbook"
brew "docbook-xsl"
brew "parallel"

# Bash 4 with auto-completion
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "screen"
brew "watch"
brew "wdiff"
brew "bash"
brew "bash-completion@2"

# Version control (Git, SVN, etc.)
brew "git"
brew "apr"
brew "apr-util"
brew "openldap"
brew "scons"
brew "perl"
brew "subversion"

# GCC and HPC stuff
brew "libmpc"
brew "isl"
brew "gcc"
brew "veclibfort"
brew "ccache"

# SQLite, Python, GDB, Ruby, and Vim
brew "sqlite", args: ["with-functions"]
brew "gdbm", args: ["with-libgdbm-compat"]
brew "makedepend"
brew "openssl"
brew "python@2"
brew "python"
brew "gdb", args: ["with-python"]
brew "ruby"
brew "vim"

# Dependencies (2), OpenSSH
brew "gpatch"
brew "m4"
brew "make"
brew "ncurses"
brew "nano"
brew "libmagic"
brew "file-formula"
brew "openssh"

# GPG and dependencies
brew "libgpg-error"
brew "libgcrypt"
brew "libksba"
brew "libassuan"
brew "pinentry"
brew "pth"
brew "libusb"
brew "libusb-compat"
brew "gpgme"
brew "gnupg"

# ASCII docs, MD5/SHA-1 hashes, Markdown, Gperf
brew "rename"
brew "tree"
brew "ack"
brew "asciidoc"
brew "zeromq"
brew "md5sha1sum"
brew "markdown"
brew "gperf"
brew "gperftools"
brew "ninja"

# Casks: Java, XQuartz, iTerm, Chrome
cask "java8"
cask "iterm2"
cask "xquartz"
cask "google-chrome"
cask "firefox"

# Boost and MPI support for multicore, hdf5
brew "swig"
brew "popt"
brew "sphinx-doc"
brew "cmake"
brew "doxygen"
brew "boost-build"
brew "libevent"
brew "open-mpi", args: ["with-cxx-bindings"]
brew "tbb"
brew "boost", args: ["without-single"]
brew "boost-mpi"
brew "boost-python"
brew "libtool"
brew "hdf5", args: ["with-mpi"]

# Tmux (with UTF-8 support)
brew "utf8proc"
brew "tmux", args: ["with-utf8proc"]

# Wget and curl (supporting HTTP/2, i18n)
brew "c-ares"
brew "cunit"
brew "libssh2"
brew "rtmpdump"
brew "spdylay"
brew "jansson"
brew "jemalloc"
brew "libev"
brew "libmetalink"
brew "libidn2"
brew "lynx"
brew "wget"
brew "curl", args: ["with-c-ares", "with-gssapi", "with-libmetalink", "with-libssh2", "with-nghttp2", "with-rtmpdump"]

# Networking and security tools (plus dependencies)
brew "aircrack-ng"
brew "airspy"
brew "bison"
brew "help2man"
brew "flex"
brew "dos2unix"
brew "tofrodos"
brew "libdnet"
brew "libpcap"
brew "tcpdump", args: ["with-libpcap"]
brew "socat"
brew "telnet"
brew "vbindiff"
brew "pv"
brew "speedtest-cli"
brew "hashcat"
brew "poco"

# Android stuff
brew "apktool"
brew "dex2jar"
brew "smali"

# iOS stuff
brew "libplist"
brew "usbmux"
brew "libimobiledevice"
brew "ideviceinstaller"
brew "ios-deploy"
brew "cocoapods"

# Relational DB management
brew "mysql", args: ["with-local-infile"], restart_service: true
brew "postgresql", restart_service: true
brew "unixodbc"

# GIS libraries (skip if unnecessary)
brew "json-c"
brew "proj"
brew "geos"
brew "gpp"
brew "freexl"
brew "liblwgeom"
brew "libxml2"
brew "libspatialite"
brew "libkml"
brew "protobuf"
brew "protobuf-c"

# Math libraries
brew "fftw", args: ["with-mpi", "with-openmp"]
brew "openblas", args: ["with-openmp"]
brew "gsl"
brew "arpack", args: ["with-mpi"]
brew "qrupdate"
brew "suite-sparse"
brew "metis"
brew "eigen"
brew "cgal"
brew "cloog"
brew "num-utils"
brew "sfcgal"

# Aquaterm Cask
cask "aquaterm"

# Java and friends
brew "ivy"
brew "ant", args: ["with-bcel", "with-ivy"]
brew "gradle"
brew "maven"
brew "scala"
brew "leiningen"
brew "kotlin"

# Image and video manipulation tools
brew "jpeg"
brew "jhead"
brew "libtiff", args: ["with-xz"]
brew "jasper"
brew "libpng"
brew "netpbm"
brew "glib"
brew "gts"
brew "fltk"
brew "giflib"
brew "libsvg"
brew "freetype"
brew "fontconfig"
brew "glib-networking"
brew "little-cms2"
brew "ghostscript", args: ["with-x11"]
brew "epstool"
brew "gl2ps"
brew "intltool"
brew "pixman"
brew "psutils"
brew "groff", args: ["with-grohtml", "with-gropdf"]
brew "openjpeg"
brew "webp"
brew "gd"
brew "ilmbase"
brew "openexr"
brew "lame"
brew "mp3gain"
brew "x264"
brew "x265"
brew "chromaprint"
brew "fribidi"
brew "libsoxr"
brew "libogg"
brew "libvorbis"
brew "flac"
brew "libsndfile"
brew "libvpx", args: ["with-visualizer"]
brew "opus"
brew "sdl2"
brew "theora"
brew "speex"
brew "speexdsp"
brew "orc"
brew "berkeley-db"
brew "libsamplerate", args: ["with-fftw", "with-libsndfile"]
brew "pango"
brew "libde265"
brew "libheif"
brew "leptonica", args: ["with-giflib", "with-openjpeg", "with-webp"]
brew "tesseract", args: ["with-all-languages", "with-serial-num-pack", "with-training-tools"]
brew "taglib"
brew "texi2html"
brew "xvid"

# Qt widget support
brew "qt"

# GTK+3 widget support
brew "dbus", restart_service: true
brew "dbus-glib"
brew "libidl"
brew "orbit"
brew "gconf"
brew "hicolor-icon-theme"
brew "gsettings-desktop-schemas"
brew "at-spi2-core"
brew "at-spi2-atk"
brew "libepoxy"
brew "gdk-pixbuf"
brew "gtk+3"
brew "gtk+"
brew "rust"
brew "libcroco"
brew "gnome-themes-standard"
brew "gobject-introspection"
brew "librsvg", args: ["with-gtk+3"]
brew "graphviz", args: ["with-gts", "with-librsvg", "with-pango"]
brew "libsvg-cairo"
brew "vala"
brew "libsoup"
brew "icon-naming-utils"
brew "adwaita-icon-theme"
brew "pygobject"
brew "py2cairo"
brew "pygtk"
brew "gtk-mac-integration"
brew "glade"
brew "libglade"
brew "gtkmm"
brew "libglademm"
brew "gtk-chtheme"
brew "gtk-engines"

# ImageMagick and GraphicsMagick
brew "imagemagick", args: ["with-fftw", "with-fontconfig", "with-ghostscript", "with-libheif", "with-librsvg", "with-openexr", "with-pango"]
brew "imagemagick@6", args: ["with-fftw", "with-fontconfig", "with-ghostscript", "with-librsvg", "with-openexr", "with-pango"]
brew "graphicsmagick", args: ["with-ghostscript", "with-little-cms2", "with-perl", "with-webp"]
brew "svg2pdf"
brew "pulseaudio", args: ["with-glib"]
brew "gstreamer"
brew "gst-plugins-base"
brew "gst-plugins-good", args: ["with-gdk-pixbuf", "with-pulseaudio"]

# Miscellaneous
brew "libssh"
brew "lua"
brew "geoip"
brew "geoipupdate"
brew "libsmi"
brew "portaudio"

# Inkscape
brew "libatomic_ops"
brew "bdw-gc"
brew "poppler"
brew "potrace"
brew "gtkmm"
brew "gtkmm3"
brew "gdl"
brew "libiconv"
brew "gtkextra"
cask "inkscape"

# Data Display Debugger (DDD)
brew "openmotif"
brew "ddd"

# GNUplot and GNU Octave (open-source programs similar to Matlab)
brew "texinfo"
brew "glpk"
brew "qhull"
brew "plotutils"
brew "pstoedit"
brew "imake"
brew "sundials"
brew "gnuplot", args: ["with-aquaterm", "with-qt"]
brew "octave", args: ["with-qt"]

# Python libraries
brew "oniguruma"
brew "jq"
brew "sip"
brew "numpy"
brew "scipy"

# FFMpeg and scrcpy (mirrors Android device screens)
brew "ffmpeg"
brew "scrcpy"

# Font manipulation
brew "fondu"
brew "ttf2pt1"

# Pandoc
brew "ghc"
brew "cabal-install"
brew "pandoc"

# Proofreading and program analysis tools for use with Emacs
brew "languagetool"
brew "proselint"
brew "ctags"
brew "global"
brew "cppcheck"
brew "cscope"
brew "tidy-html5"
brew "node"
brew "jsonlint"
cask "emacs"

# Communications stuff
brew "wxwidgets"
brew "hamlib"
brew "minicom"
brew "minimodem"
brew "librtlsdr"
brew "pothosware/pothos/soapysdr"
brew "pothosware/pothos/soapyrtlsdr"
brew "pothosware/pothos/libosmosdr", args: ["HEAD"]
brew "pothosware/pothos/muparserx"
brew "pothosware/pothos/pothos"

# OpenCV
brew "opencv"
brew "opencv@2", link: false

# FUSE, SSHFS, NTFS, and EXT filesystems
cask "osxfuse"
brew "sshfs"
brew "ntfs-3g"
brew "e2fsprogs"
brew "ext2fuse"

# More GIS libraries
brew "libpq"
brew "gdal"
brew "zstd"
brew "postgis", args: ["with-protobuf-c"]

# Install fonts via casks. To my knowledge, all these are free to use
# (zero cost, OFL-like licenses). You should *always* read and agree 
# to licenses before installing fonts.
cask "font-arimo"
cask "font-clear-sans"
cask "font-cousine"
cask "font-hack"
cask "font-ibm-plex"
cask "font-lato"
cask "font-liberation-sans"
cask "font-menlo-for-powerline"
cask "font-noto-sans"
cask "font-noto-sans-mono"
cask "font-noto-serif"
cask "font-open-sans"
cask "font-powerline-symbols"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-stix"
cask "font-tinos"
cask "font-urw-base35"


# Cask macOS apps. Note: some apps (such as Omni Group ones) have
# proprietary licenses. *Always* read and agree to the respective
# license agreements before installing apps.
cask "osxfuse"
cask "android-file-transfer"
cask "android-ndk"
cask "android-platform-tools"
cask "android-sdk"
cask "android-studio"
cask "arduino"
cask "box-sync"
cask "calibre"
cask "celestia"
cask "cyberduck"
cask "dropbox"
cask "emacs"
cask "fiji"
cask "gfxcardstatus"
cask "gimp"
cask "graphsketcher"
cask "ibackupbot"
cask "intellij-idea-ce"
cask "jd-gui"
cask "libreoffice"
cask "marble"
cask "max"
cask "megasync"
cask "mendeley"
cask "mp3gain-express"
cask "mysqlworkbench"
cask "omnidisksweeper"
cask "omnifocus"
cask "omnigraffle"
cask "pacifist"
cask "path-finder"
cask "pgadmin4"
cask "qcad"
cask "scribus"
cask "skim"
cask "skype"
cask "soapui"
cask "sourcetree"
cask "tabula"
cask "teamviewer"
cask "texmaker"
cask "thunderbird"
cask "tor-browser"
cask "transmission"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "weka"
cask "wireshark"

